{
  "title": "Description",
  "content": [
    {
      "title": "★Steady state",
      "content": "Generally speaking, steady state appears between 6 and 12 breaths per minute.<br>Steady breath state is measured by breathing more consistently and slowly than the average speed. In Spire, it is a term of the \"Autonomic nerve down-regulated\" relaxed state. In this state, the parasympathetic nerve will be activated and produce individual characteristics of \"quietness and digestion\" in the nervous system related to the maintaining of blood pressure, sexual function, the health of digestive and immune system and sleep quality. Also, it can eliminate stress and help maintain physical and mental health.<br>The Spire App is able to inform you when maintaining long-time steady breath, and provide specific progress over time."
    },
    {
      "title": "★Tension state ",
      "content": "This state generally appears between 18 and 24 breaths per minute.<br>The state of intense breathing is measured by irregularly breathing(especially exhaling) more rapidly than the average speed. In Spire, it is a term of the up-regulated autonomic nerve state related to restlessness, increased cognitive load, waver or excitement.<br>In this state, the sympathetic nerve will be activated and produce individual characteristics of \"struggle or escape\" in the nervous system. This state is prepared for the threatened state, so it has some advantages, for example, it helps to preserve emotional memory, restrict blood flow in the body and prepare the body for exercise.<br>However, repeated or frequent tension state can lead to high cortisol level, hypertension, adrenal fatigue and gastrointestinal disease and cause damage to the immune system.<br>Your Spire App can provide the change of specific progress over time as you enter the state of intense breath."
    },
    {
      "title": "★Concentrated state",
      "content": "In this state, the stability and consistency of breathing will be enhanced.<br> Concentrated breathing state is measured by the respiratory rate close to that of normal breathing, but it is more consistent than normal breathing. In Spire, it is a term of the continuously attentive and concentrated state.<br>This state can maintain the balance between sympathetic and parasympathetic nerves, thus producing the individual characteristics of threat detection and vigilance.<br> This is a form of the \"positive pressure\" generated when the extreme of our ability is challenged, it enables us to complete challenge without anxiety. Reaching this state during mental activities is called being in the \"domain\" or \"process\".<br>Your Spire App can inform you when you enter the concentrated breathing state and provide the changes of specific status over time."
    }
  ]
}
