{
  "deficiency": "deficiency symptoms",
  "sources": "natural sources",
  "description": "description",
  "toxicity": "toxicity symptoms",
  "recommendedIntake": "recommended intake",
  "supplement": "as a supplement",

  "bile_acid": {
    "name": "bile acid",
    "sources": "",
    "supplement": "",
    "toxicity": "",
    "recommendedIntake": "",
    "description": "",
    "deficiency": ""
  },
  "biotin": {
    "name": "biotin",
    "sources": "Pork liver, egg yolk, black-eyed peas, raspberries, cauliflower...\nBiotin is not destroyed by cooking.",
    "supplement": "The UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that the upper safe level for long-term supplementation is 900 mcg of biotin daily.",
    "toxicity": "Biotin has no known toxic effects, even in very large doses.",
    "recommendedIntake": "The daily reference intake of Biotin for adults is 50 mcg.\nThere is no established Tolerable Upper Intake Level (UL) for Biotin.",
    "description": "Biotin (Vitamin B7) is one of eight vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in the water before your body can absorb them. The body cannot store them (except vitamin B12), so regular daily intake is necessary. They help the body convert food into fuel (glucose), which in turn produces energy. Biotin is involved in the synthesis of keratin, a protein responsible for the strenth of hair, nails and skin surface. As such, it is a vital ingredient in all vitamin and mineral beauty formulas.",
    "deficiency": "Brittle nails and hair loss\nSkin rash\nSkin disease: seborrhoeic dermatitis (sebopsoriasis)\nNeurological symptoms: depression, lethargy, hallucinations, numbness and tingling sensations in the extremities\nReduced amount of energy produced by the body\nGlucose level disturbance (reduced insulin secretion [Type 2 Diabetes])"
  },
  "calcium": {
    "name": "calcium",
    "sources": "Milk, cheese and yogurt as well as tofu, kale, white beans, cabbage (Pak Choi), fish with soft bone, dried figs...",
    "supplement": "",
    "toxicity": "Intake in excess of recommended doses can lead to constipation and an increased risk of kidney stones.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of calcium for adults is 800 mg.\nThe Tolerable Upper Intake Level (UL) for calcium is 2500 mg.",
    "description": "Calcium is a mineral found in many foods. The body needs calcium to maintain bone strength and carry out important functions, but vitamin D is required for optimal calcium absorption. Almost all calcium is stored in bones and teeth, supporting their structure and density.\nThe body also needs calcium for contractions of muscles and transmission of information between the brain and nerves in each body part. In addition, calcium is used to help blood vessels move blood throughout the body and facilitate the release of hormones and enzymes that affect almost every function.",
    "deficiency": "Insufficient intake of calcium does not produce obvious symptoms in the short-term because the body maintains calcium levels in the blood by taking it from bones. In the long-term, intake of calcium below recommended levels can lead to significant health consequences, such as low bone mass (osteopaenia) and increased risk of osteoporosis and bone fractures.\nSymptoms of severe calcium deficiency include numbness and tingling in the fingers, convulsions and an abnormal heart rhythm"
  },
  "chromium": {
    "name": "chromium",
    "sources": "Broccoli, turkey ham (processed), apples, lettuce, grape juice, waffle...\nChromium is not destroyed by cooking.",
    "supplement": "The UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that the upper safe level for long-term supplementation is 10 mcg of chromium per day.",
    "toxicity": "Toxicity from dietary and supplemental chromium has not been reported and is unlikely to occur.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of chromium for adults is 40 mcg.\nThere is no established Tolerable Upper Intake Level (UL) for chromium.",
    "description": "Chromium is a trace element and an essential mineral for the body. Known to enhance the way our bodies use insulin, this mineral contributes to the maintenance of normal blood glucose levels. Chromium also appears to be directly involved in carbohydrate, fat, and protein metabolism.\nPeople who eat highly-refined diets (especially those rich in simple sugars) may be at risk of insufficient chromium intake. Infection, heavy exercise, pregnancy, lactation and stress increase chromium losses and can lead to deficiency.",
    "deficiency": "Insulin resistance\nGlucose intolerance\nLipid abnormalities\nNumbness and pain in hands and feet"
  },
  "coenzyme_q10": {
    "name": "coenzyme Q10",
    "sources": "Organ meats (beef and chicken), herring, canola oils, pistachio nuts...",
    "supplement": "",
    "toxicity": "",
    "recommendedIntake": "",
    "description": "CoQ10 is a fat-soluble nutrient, meaning it should be taken with meals containing fat so the body can absorb it. It occurs naturally in the body, but it is also present in many types of food. CoQ10 acts as an antioxidant, which protects cells from damage and plays an important part in metabolism. The levels of coenzymeQ10 seem to be lower in older people and in people with chronic diseases, such as cardiac problems, cancer, Parkinson's disease, diabetes, HIV/AIDS, and muscular dystrophies. It is not known whether low levels of coQ10 contribute to these disorders.",
    "deficiency": "People with chronic diseases such as heart failure, kidney or liver problems, or diabetes should be wary of using this supplement. CoQ10 may lower blood sugar levels and blood pressure. Doses of more than 300 mg may affect liver enzyme levels. CoenzymeQ10 may decrease anticoagulant efficacy of warfarin. Some people have experienced gastrointestinal symptoms (e.g., nausea, diarrhea, appetite suppression, heartburn, and abdominal discomfort)."
  },
  "copper": {
    "name": "copper",
    "sources": "Beef (organ meats), mollusks, macadamia nuts, bran flakes, grain, black pepper, chocolate, cocoa...",
    "supplement": "",
    "toxicity": "Acquired copper toxicity can result from ingesting or absorbing excess copper (e.g. from ingesting acidic foods or beverages that have had prolonged contact with a copper container). Self-limiting gastroenteritis with nausea, vomiting and diarrhoea may occur.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of copper for adults is 1000 mcg.\nThe Tolerable Upper Intake Level (UL) for Copper is 10000 mcg.",
    "description": "Copper is required to help your body absorb iron. It works together with iron to form red blood cells and keeps nerve cells and the immune system healthy. It is also important for nerve function, bone growth, and sugar metabolism. Your body needs copper to make energy.",
    "deficiency": "Copper is used for treating copper deficiency and the anaemia it may cause. Too little copper in the body is rare, but may occur in those who get too much zinc from diet or supplements, have had intestinal bypass surgery or are provided nutrition by feeding tubes."
  },
  "folic_acid": {
    "name": "folic acid",
    "sources": "Lentils, asparagus, garbanzo beans, enriched spaghetti, root vegetables, orange, orange juice...\nFolate from food is destroyed by cooking, processing and storage.",
    "supplement": "Folic acid deficiency: 250-1000 mcg per day.\nPreventing neural tube defects: at least 400 mcg of folic acid per day from supplements or fortified food should be taken by women prior to conception and continued through the first month of pregnancy.",
    "toxicity": "Folate is essentially non-toxic.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of folic acid for adults is 200 mcg.\nThe Tolerable Upper Intake Level (UL) for folic acid is 1000 mcg (supplement) and 200 mcg (diet) daily.",
    "description": "Folic acid (folate or vitamin B9) is one of the eight vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. Our bodies need folic acid to synthesise DNA and other genetic material. Folic acid is also needed for the body cells to divide. It helps the nervous system function and, in particular, production of neurotransmitters that are used by nerves to send signals throughout the body. High levels of folic acid can conceal a vitamin B12 deficiency.\nAdequate dietary folic acid (together with vitamin B6 and B12) helps maintain normal levels of homocysteine.",
    "deficiency": "Weakness, fatigue, difficulty concentrating, irritability, headache, heart palpitations and shortness of breath (megaloblastic anaemia)\nSoreness and shallow ulcerations in the tongue and oral mucosa\nChanges in skin and hair\nFingernail pigmentation\nElevated blood concentrations of homocysteine \nChronic and heavy alcohol consumption is associated with diminished absorption of folic acid."
  },
  "glucosamine": {
    "name": "glucosamine",
    "sources": "",
    "supplement": "Glucosamine is presumed safe, even when taken for years; however, side effects may include:\nConstipation\nDiarrhoea\nDrowsiness\nHeadache\nHeartburn\nNausea\nRash",
    "toxicity": "",
    "recommendedIntake": "",
    "description": "The key material for cartilage tissue formation, glucosamine is a compound of amino acid glutamine and glucose. Cartilage is a type of flexible, tough connective tissue found in several areas of the body. This fine, rubbery tissue serves as a form of padding or cushion for bones and joints. Glucosamine is also found in the hard covering of shellfish. With age, glucosamine levels decrease and this can lead to eventual joint deterioration.",
    "deficiency": "Joint aches and pains\nMuscle and joint stiffness"
  },
  "haemoglobin": {
    "name": "haemoglobin",
    "sources": "",
    "supplement": "",
    "toxicity": "",
    "recommendedIntake": "",
    "description": "",
    "deficiency": ""
  },
  "iodine": {
    "name": "iodine",
    "sources": "Iodine is found naturally in some foods and is also added to salt that is labelled as ‘iodised’. Cod fish and seaweed contain iodine.",
    "supplement": "",
    "toxicity": "Acute iodine poisoning is rare and usually occurs only with doses of many grams.\nSymptoms include burning of the mouth, throat, and stomach, fever, nausea, vomiting, diarrhoea, a weak pulse, cyanosis, and coma.\nGoitre\nThyroid gland inflammation, thyroid cancer\nIodine supplements might interact with anti-thyroid medication.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of iodine for adults is 150 mcg.\nThe Tolerable Upper Intake Level (UL) for iodine is 1100 mcg.",
    "description": "Iodine is a mineral found in some foods. Insufficient iodine intake impairs the production of thyroid hormones, leading to hypothyroidism. These hormones control the body's metabolism and many other important functions. Most of the world’s iodine is found in the ocean. Seafood is an excellent source of dietary iodine.\nTo eliminate iodine deficiency salt iodization programs have been implemented in almost all countries.",
    "deficiency": "Goitre, an enlarged thyroid gland, is often the first visible sign of iodine deficiency."
  },
  "iron": {
    "name": "iron",
    "sources": "Lean red meat, seafood, poultry, iron-fortified breakfast cereals and breads, kidney beans, cashew nuts, dried fruits such as raisins...",
    "supplement": "",
    "toxicity": "Taking high doses of iron supplements (especially on an empty stomach) can cause upset stomach, constipation, nausea, abdominal pain, vomiting and fainting. High doses of iron can also decrease zinc absorption. Extremely high doses of iron can cause organ failure, coma, convulsions and death.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of iron for adults is 14 mg.\nThe Tolerable Upper Intake Level (UL) for iron is 45 mg.",
    "description": "Iron is a mineral that the body needs for growth and development. Your body uses iron to make haemoglobin (a protein in red blood cells that carries oxygen from the lungs to the other parts of the body) and myoglobin (a protein that provides oxygen to the muscles). Your body also needs iron to make some hormones and connective tissue.",
    "deficiency": "Most of the symptoms of iron deficiency are a result of the associated anaemia and may include fatigue, rapid heart rate, palpitations and rapid breathing upon exertion.\nIron deficiency impairs athletic performance and physical work capacity.\nFrequent blood donors have an increased risk of iron deficiency.\nTiredness and lack of energy\nGastrointestinal upset\nPoor memory and concentration\nImpaired ability to fight off germs and infections or to control body temperature"
  },
  "magnesium": {
    "name": "magnesium",
    "sources": "Bran cereals, swiss chard, pumpkin seeds, quinoa, brown rice, blackstrap molasses, lima beans...",
    "supplement": "For mild magnesium deficiency: 3 grams every 6 hours\nFor reducing the frequency and severity of migraine headaches in adults:\nMagnesium citrate 1830-3625 mg in divided doses for up to 3 months. Magnesium oxide 400 mg twice a day.",
    "toxicity": "The risk of dietary toxicity from magnesium for healthy adults is very low. Too much magnesium from supplements has been linked to loose stools, but this is unlikely to happen from food intake alone. However, people with renal failure are at risk of overdose symptoms which include:\nNausea, vomiting\nRetention of urine\nDepression\nLethargy before progressing to muscle weakness\nDifficulty in breathing, irregular heartbeat",
    "recommendedIntake": "The Daily Reference Intake (DRI) of magnesium for adults is 375 mg.\nThe Tolerable Upper Intake Level (UL) for magnesium for adults is 350 mg (as supplement + diet).",
    "description": "Magnesium is necessary for energy production and almost all metabolic processes. Magnesium helps keep blood pressure normal, bones and teeth healthy, and the heart rhythm steady. It is essential for normal functioning of the nervous system and in muscle tissue, where it works together with calcium. In a typical muscle contraction calcium acts as a stimulant, while magnesium acts as a relaxant. Magnesium also contributes to reduction of tiredness and fatigue. Interestingly, magnesium is the main ingredient in many antacids and laxatives.\nAn adult’s body contains approximately 25 g of magnesium, with 50% to 60% present in the bones and most of the rest in soft tissue.",
    "deficiency": "Loss of appetite, nausea, fatigue, feeling of weakness\nMuscle cramps\nAbnormal heart rhythms\nConstipation (i.e., irregular bowel movements)\nTension headaches\nOsteoporosis"
  },
  "manganese": {
    "name": "manganese",
    "sources": "Pineapple and pineapple juice, barley, pecans, almonds, navy beans, buckwheat, green tea...\nManganese is not destroyed by cooking or storage.",
    "supplement": "The UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that the upper safe level for long-term supplementation is 4 mg for adults and 0.5 mg of manganese per day for older people.",
    "toxicity": "Neurologic problems",
    "recommendedIntake": "The daily reference intake of Manganese for adults is 2 mg.\nThe Tolerable Upper Intake Level (UL) for Manganese is 11 mg.",
    "description": "Manganese is a trace element and an essential mineral involved in numerous chemical processes in the body, including the processing of cholesterol, carbohydrates and protein. The highest concentration of manganese can be found in bone marrow and it contributes to the maintenance of healthy and normal bone structure. As the mineral is needed for collagen production, it is also important for skin health.\nManganese is a co-factor for an enzyme called manganese superoxide dismutase, which is a potent antioxidant associated with protection against free radical damage.",
    "deficiency": "Growth and development restrictions\nSkeletal disorders\nImpaired glucose tolerance\nAltered carbohydrate and lipid metabolism\nWeakness, nausea\nWeak hair and nails"
  },
  "omega-3fattyacids": {
    "name": "omega 3-6",
    "sources": "omega-3\nOily fish, flaxseed oil, chia seeds, walnuts...\n \nomega-6\nSoybean oil, corn oil, sunflower oil, primrose oil, borage oil, pine nuts, blackcurrant seed oil...",
    "supplement": "",
    "toxicity": "omega-3\nFishy eructation, nausea, and diarrhoea may occur. The risk of bleeding increases with EPA/DHA >3 g per day.\n \nomega-6\nSome omega-6 fatty acids tend to promote inflammation. Typically, omega-6 toxicity occurs due to an altered ratio of omega-3/omega-6 fatty acids, common in Western diets, while the Mediterranean diet puts emphasis on foods that are rich in omega-3 fatty acids.",
    "recommendedIntake": "omega-3\nThe recommendation for general adult population and children 16-18 years of age is 250 mg EPA + DHA per day. EPA and DHA contribute to the normal function of the heart and for a beneficial effect 250 mg of EPA and DHA daily is required. DHA contributes to the maintenance of normal brain function and normal vision with a daily intake of 250 mg of DHA. ALA contributes to the maintenance of normal blood cholesterol levels with a daily intake of 2 g of ALA.\nTolerable Upper Intake Level (UL):\nThe EFSA states that available data are not sufficient to establish a tolerable upper intake level for DHA and EPA for any population group. The EFSA considers that supplemental intakes of EPA and DHA combined at doses up to 5 g per day and supplemental intakes of EPA alone up to 1.8 g per day do not raise safety concerns for the adult population; supplemental intake of DHA alone up to 1 g per day does not raise a safety concern for the general population.\n",
    "description": "omega-3\nOmega-3 fatty acids are considered as essential fatty acids. Although necessary for human health, the body is incapable of producing them on its own. Omega-3s belong to a broader group of fats called polyunsaturated fats or PUFA. \nThere are two major types of omega-3 fatty acids in our diets: the first type is alpha-linolenic acid (ALA), found in vegetable oils such as rapeseed, canola, flaxseed, and walnuts. The other type, eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), is found in fatty fish. The body partially converts ALA to EPA and DHA. Western diets are typically low in omega–3s. The Mediterranean diet puts emphasis on foods that are rich in omega-3 fatty acids. Omega-3s reduce inflammation. Fish oil from supplements and food sources can reduce triglyceride levels.\n \nomega-6\nOmega-6 fatty acids belong to a group of fatty acids called polyunsaturated fats or PUFA. The primary dietary omega-6 is linoleic acid (LA), which, although not produced by the body, is considered an essential fatty acid as it is vital for human health. Linoleic acid is part of cell components and is used for synthesis of signalling molecules in the body. LA is converted in the body to gamma-linolenic acid (GLA). It is then further broken down to arachidonic acid (AA). GLA is found in several plant based oils, including evening primrose oil, borage oil, and blackcurrant seed oil.",
    "deficiency": "omega-3\nFatigue\nPoor memory\nDry skin\nHeart problems\nMood swings\nDepression \nPoor circulation\n \nomega-6\nDry eyes\nSkipped heart beats\nJoint pain\nThin skin"
  },
  "pepsin": {
    "name": "pepsin",
    "sources": "",
    "supplement": "",
    "toxicity": "",
    "recommendedIntake": "",
    "description": "",
    "deficiency": ""
  },
  "potassium": {
    "name": "potassium",
    "sources": "Bananas, tomatoes, artichoke, prune juice, peaches...",
    "supplement": "",
    "toxicity": "There have been no recorded adverse effects of excessive consumption from food alone; however, potassium from supplements or salt substitutes can result in hyperkalemia and possibly sudden death should excess amounts be consumed by individuals with chronic renal insufficiency (kidney disease) or diabetes. Keeping the right potassium balance in the body depends on the amount of sodium and magnesium in the blood. Too much sodium may increase the need for potassium.\nIndividuals taking medication for cardiovascular disease such as ACE inhibitors, ARBs (Angiontensin Receptor Blockers), or potassium sparing diuretics should be mindful not to consume supplements containing potassium and may need to consume less of it than the AI.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of potassium for adults is 2000 mg.\nA Tolerable Upper Intake Level (UL) has yet to be established; however, the EVM for long-term supplementation is 3700 mg.",
    "description": "Potassium is an essential dietary mineral and electrolyte. Almost 98% of potassium is found inside the cells. Minor changes in the level of potassium that is present outside the cells can have severe effects on the heart, nerves and muscles. Potassium is crucial to heart function and plays a key role in bones and in smooth muscle contraction.\nThe kidneys are the main organ that controls the balance of potassium by removing excess potassium into the urine.\nDehydration, diarrhoea, excessive sweating (hyperhidrosis) and laxative abuse are common causes of low potassium levels. Deficiency may also be caused by a lack of potassium in the diet; however, this is uncommon. Other causes include medicines that affect the amount of potassium in the body, such as diuretics.",
    "deficiency": "Weakness, tiredness\nTingling or numbness\nNausea or vomiting\nConstipation\nIrregular heartbeat\nLow blood pressure\nFrequent urination\nAbnormal psychological behaviour"
  },
  "proteins": {
    "name": "proteins",
    "sources": "",
    "supplement": "",
    "toxicity": "",
    "recommendedIntake": "",
    "description": "",
    "deficiency": ""
  },
  "selenium": {
    "name": "selenium",
    "sources": "Brazil nuts, yellowfin tuna, shrimp, scallops, noodles, garlic... \nSelenium is not destroyed by cooking or storage.",
    "supplement": "Autoimmune thyroiditis (Hashimoto's thyroiditis): 200 mcg daily.",
    "toxicity": "Hair and nail brittleness and loss\nDermatitis\nNausea, diarrhoea\nFatigue, irritability and nervous system abnormalities\nA garlic odour to the breath",
    "recommendedIntake": "The Daily Reference Intake (DRI) of selenium for adults is 55 mcg.\nThe Tolerable Upper Intake Level (UL) for selenium is 400 mcg daily.",
    "description": "Selenium is a trace element needed only in small amounts, but like all essential elements, it can be toxic at high levels. Generally, selenium acts as an antioxidant that works together with vitamin E. It is part of numerous enzymes that play a critical role in reproduction and DNA synthesis. Selenium concentration is higher in the thyroid gland than in any other organ in the body and, like iodine, it has an important function in thyroid hormone synthesis and metabolism. Selenium significantly contributes to normal functioning of the immune system and it is needed for the maintenance of healthy hair and nails.\nThe amount of selenium in food depends on where it is grown or raised as most of the selenium in the body comes from the diet. People who live in areas with very little selenium in the soil (for example China) have a higher risk of deficiency, as do the chronically ill.",
    "deficiency": "Frequent infections, cold, flu, sore throat or sinus infection (i.e. impaired function of the immune system)\nFatigue, muscle weakness\nMale infertility\nHeart diseases\nProneness to developing different types of cancer\nGrowth and development restrictions"
  },
  "sodium": {
    "name": "sodium",
    "sources": "Processed foods to which sodium chloride (salt)/benzoate/phosphate have been added, salted meats, nuts, cold cuts, salt added to foods in cooking or at the table. Salt is 40% sodium by weight.",
    "supplement": "",
    "toxicity": "The adverse effects of excessive consumption are hypertension and increased risk of cardiovascular disease.",
    "recommendedIntake": "Dietary need for sodium for adults is 1500 mg per day.\nA Tolerable Upper Intake Level (UL) for sodium has yet to be established.",
    "description": "Sodium regulates the volume of water and blood in the body. It shares this role with potassium. Salt is added to food when cooking, baking or canning to enhance the flavour. As a result, people in industrialized countries consume up to 20 times more sodium than necessary. Overuse of salt results in water retention in the body (outside the cells in the extracellular fluid), blood vessel stiffness, high blood pressure and increased calcium excretion. The average American diet contains 10 grams of salt per day although we need 6-8 times less than that.",
    "deficiency": "Dietary deficiency of sodium is highly uncommon because of widespread presence of sodium in food."
  },
  "vitamin_a": {
    "name": "vitamin A",
    "sources": "Veal liver (cooked), cod liver oil, butter, whole fat milk as well as carrots, spinach, sweet potato, melon, mango... \nBeta-carotene sources: carrot, spinach, kale, sweet potato, swiss chard, broccoli, melon, apricot, mango, peach. Vitamin A is not destroyed by cooking.",
    "supplement": "The UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that the upper safe level for long-term supplementation is 1500 mcg of vitamin A (retinol) per day.",
    "toxicity": "Nausea, headache, fatigue\nLoss of appetite\nDizziness\nDry itchy skin\nSkin peeling (desquamation)\nCerebral oedema\nBone and joint pain",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin A for adults is 800 mcg.\nThe Tolerable Upper Intake Level (UL) of Vitamin A for adults is 3000 mcg.",
    "description": "Vitamin A is a fat-soluble vitamin, meaning it dissolves in fat and can be stored in your body until needed. It is present in food in two main forms: retinoids (found in animal products) and provitamin A carotenoids (found in plants). The most important provitamin A carotenoid is beta-carotene, which can be converted into vitamin A by the body.\nAs an essential component of rhodopsin, a protein that absorbs light, vitamin A is crucial for vision. It supports cell growth and development and plays a vital role in the normal formation and maintenance of the heart, lungs, kidneys and other organs. Vitamin A is involved in immune system function and is necessary for the health of the skin and the mucous membrane.",
    "deficiency": "Impaired dark adaptation or night blindness\nDry eye (xerophthalmia)\nDry, hard and cracked skin, dry hair without shine\nRespiratory infections\nKeratinization of the skin and mucous membranes in the respiratory, gastrointestinal and urinary tracts"
  },
  "vitamin_b1": {
    "name": "vitamin B1",
    "sources": "Whole wheat bread, brewer's yeast, green peas, white rice, oats...\nIn the preparation of food, thiamine is very sensitive to boiling or moist heat and can be easily destroyed; it is much less susceptible to dry heat, such as baking.",
    "supplement": "Mild thiamine deficiency: 5-30 mg daily in either a single dose or divided doses for one month.\nSevere deficiency: up to 300 mg per day.\nThere is no risk of overdosing; however, the UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that upper safe levels for long term supplementation is 100 mg of vitamin B1 daily.",
    "toxicity": "There are no reports of toxicity related to dietary intake of vitamin B1.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin B1 for adults is 1.1mg.\nA Tolerable Upper Intake Level (UL) for vitamin B1 has not been established.",
    "description": "Vitamin B1 (thiamine) is one of the eight vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. As vitamin B1 plays a central role in the metabolism of energy, deficiency of this nutrient impairs nearly every important function of the body.\nThiamine plays a pivotal role in neural functions and is essential for the structure and integrity of brain cells. Like other B-complex vitamins, vitamin B1 is sometimes called an 'anti-stress' vitamin because it strengthens the immune system and enhances the body's ability to withstand stressful conditions.",
    "deficiency": "Fatigue, irritability, depression and abdominal discomfort\nMental fatigue\nPoor concentration\nSwelling, tingling, or burning sensation in the hands and feet\nConfusion\nMuscle pain and muscle weakness\nTachycardia (abnormally fast heart rate)"
  },
  "vitamin_b12": {
    "name": "vitamin B12",
    "sources": "Clams (steemed), mackerel (cooked), beef steak, lamb liver, mussels, brie cheese, skimmed milk...\nVitamin B12 is not destroyed by cooking or storage.",
    "supplement": "For Vitamin B12 deficiency or pernicious anaemia: 300-2000 mcg daily.\nThe UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that the upper safe level for long-term supplementation is 2000 mcg of vitamin B12 daily.",
    "toxicity": "In healthy people, no adverse effects have been associated with large intake of vitamin B12 from food or supplements.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin B12 for adults is 2.5 mcg.\nThere is no established Tolerable Upper Intake Level (UL) for vitamin B12.",
    "description": "Vitamin B12 (cobalamin) is one of the eight different vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. Vitamin B12 is also needed for the proper function and development of the brain, nerves and blood cells. Severe B12 deficiency causes nerve damage. An important role of vitamin B12 is the prevention of excessive homocysteine build-up in the blood; elevated homocysteine levels in blood are a risk factor for cardiovascular diseases. Vitamin B12 also contributes to the normal function of the immune system and helps prevent megaloblastic anaemia, which affects energy levels and causes weakness.\nAs hydrochloric acid in the stomach is necessary for vitamin B12 absorption, the elderly are at risk of deficiency. Strict vegans and people with atrophic gastritis or celiac disease are at high risk of developing vitamin B12 deficiency.",
    "deficiency": "Tiredness, weakness\nConstipation\nLoss of appetite, weight loss\nMegaloblastic anaemia\nNumbness and tingling in the hands and feet\nProblems with balance\nDepression, confusion\nPoor memory\nIt is important to supplement vitamin B12 in a vegan diet because this vitamin is not found in plants."
  },
  "vitamin_b2": {
    "name": "vitamin B2",
    "sources": "Wheat germ, cheddar cheese, hard-boiled eggs, chicken (dark meat), halibut fish, brussels sprouts...\nAlthough highly sensitive to light, vitamin B2 is not destroyed by cooking or when stored properly.",
    "supplement": "For treating low levels of vitamin B2 in adults (riboflavin deficiency): 5-30 mg of riboflavin daily in separate doses.\nThere is no risk of overdosing; however, the UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that upper safe levels for long term supplementation is 40 mg of vitamin B2 daily.\nAn excess of the vitamin is excreted in the urine; yellow urine is a clear sign of riboflavin presence and no cause for concern.",
    "toxicity": "There are no reports of toxicity related to dietary intake of vitamin B2.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin B2 for adults is 1.4mg.\nA Tolerable Upper Intake Level (UL) for vitamin B2 has yet to be established.",
    "description": "Vitamin B2 (riboflavin) is one of eight vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. Riboflavin also acts as an antioxidant, fighting the damaging particles in the body known as free radicals.\nVitamin B2 is required for proper development and function of the skin, lining of the digestive tract and production of red blood cells. It also helps the body process vitamin B6 and folate into useable forms.",
    "deficiency": "Fatigue\nDigestive problems\nCracks and sores around the corners of the mouth\nEye fatigue\nSwelling and soreness of the throat\nInflammation and redness of the tongue (magenta tongue)\nSensitivity to light\nAnaemia\nFlaking and peeling of facial skin – particularly around the nose, lips and ears (Seborrhoeic dermatitis)"
  },
  "vitamin_b3": {
    "name": "vitamin B3",
    "sources": "Chicken (light meat), chinook salmon, lean beef, peanuts, beets...",
    "supplement": "When clinical deficiency is established, niacin is given in doses of 250 mg to 500 mg daily.",
    "toxicity": "Niacin (not niacinamide) in large amounts is sometimes used to lower LDL cholesterol and triglyceride (fat) levels and to increase HDL cholesterol levels in the blood. Symptoms may include flushing and, rarely, hepatotoxicity.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin B3 for adults is 16 mg.\nThe Tolerable Upper Intake Level (UL) of vitamin B3 is 35 mg per day.",
    "description": "Vitamin B3 (niacin) is one of eight different vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. Niacin is involved in over 200 enzymatic processes in the body.",
    "deficiency": "Depression\nHeadache\nPoor circulation\nFatigue\nLoss of memory\nVomiting\nConstipation or diarrhoea\nBright red tongue"
  },
  "vitamin_b5": {
    "name": "vitamin B5",
    "sources": "Beef liver, trout, lobster, mushrooms, feta cheese, split peas...",
    "supplement": "",
    "toxicity": "No toxicity has been associated with dietary and supplemental pantothenic acid such that no tolerable upper intake level (UL) has been set.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin B5 for adults is 6 mg. \nA Tolerable Upper Intake Level (UL) has yet to be established; however, the EVM for long-term supplementation is 200 mg.",
    "description": "Vitamin B5 (pantothenic acid) is one of the eight different vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. Vitamin B5 is part of one of the most important coenzymes in the body – coenzyme A. It is involved in almost 70 different chemical reactions in the body and thus significantly influences energy levels.\nPantothenic acid is crucial for synthesis of some hormones, vitamin D and some signal molecules in the brain.",
    "deficiency": "Pantothenic acid is widely distributed in nature and deficiency is extremely rare."
  },
  "vitamin_b6": {
    "name": "vitamin B6",
    "sources": "Turkey (light meat), chickpeas, russet potatoes (with skin), dried plums, bananas...\nProlonged exposure to high temperatures can destroy vitamin B6. When preparing food, adding a little vinegar or tomato to a sauce helps preserve vitamin B6 during the process of cooking.",
    "supplement": "For vitamin B6 deficiency in adults: 2.5-25 mg daily for three weeks, then 1.5-2.5 mg per day as maintenance treatment.\nFor vitamin B6 deficiency in women taking oral contraception: 25-30 mg per day.",
    "toxicity": "Nerve irritation\nHeadaches\nMood changes",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin B6 for adults is 1.4 mg.\nThe Tolerable Upper Intake Level (UL) for vitamin B6 is 100 mg daily.",
    "description": "Vitamin B6 (Pyridoxine) is one of eight vitamins that make up the B vitamin complex. All B vitamins are water-soluble, which means they are dissolved in water before your body can absorb them. The body cannot store them (except vitamin B12) so regular daily intake is necessary. They help the body convert food into fuel (glucose), which is used to produce energy. Vitamin B6 is crucial for converting carbohydrates into energy and is necessary for the synthesis and decomposition of proteins. The body needs vitamin B6 for more than 100 enzyme reactions involved in metabolism. It is also involved in brain development during pregnancy and infancy and supports immune function.\nVitamin B6 is used for prevention and treatment of anemia (“tired blood”). It is involved in haemoglobin synthesis (haemoglobin is found in red blood cells and it’s critical to their ability to transport oxygen throughout the body) and in maintaining normal levels of homocysteine. High levels of homocysteine appear to be associated with heart disease. Vitamin B6 helps your body create the hormone serotonin that influences mood.\nInadequate vitamin B6 presence is usually associated with low concentrations of other B-complex vitamins, such as vitamin B12 and folate.",
    "deficiency": "Anaemia, low haemoglobin level, high level of homocysteine\nEEG abnormalities\nDermatitis with cheilosis (scaling on the lips and cracks at the corners of the mouth)\nSwollen tongue\nDepression and confusion\nIrritability"
  },
  "vitamin_c": {
    "name": "vitamin C",
    "sources": "Citrus fruits, papaya, strawberries, cranberries, blueberries, watermelon, peppers and dark green, leafy vegetables...\nVitamin C is destroyed by heat and prolonged storage.",
    "supplement": "Preventive: 250-500 mg per day for healthy people.\nFor treatment of the common cold: 1-3 grams daily.\nFor scurvy: 100-250 mg once or twice daily for several days.",
    "toxicity": "Gastrointestinal disturbances, nausea and diarrhoea.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin C for adults is 80 mg. \nThe Tolerable Upper Intake Level (UL) for vitamin C for adults is 2000 mg.",
    "description": "Vitamin C (Ascorbic acid) is arguably the best known of all the nutrients. It is a water-soluble vitamin that acts as an antioxidant, helping to protect cells from the damage caused by harmful free radicals. Vitamin C needs to be consumed daily as it cannot be stored inside the body.\nVitamin C is necessary for production of collagen, a protein that plays a critical role in the structure of our bodies. Collagen is very important for healthy skin, gums, blood vessels, eyes, the central nervous system and reproductive organs.\nVitamin C improves the absorption of iron from plant-based foods and helps the immune system function properly in protecting the body from diseases. Vitamin C is also necessary for the synthesis of neurotransmitters such as serotonin, a hormone extremely important for nervous and endocrine systems.\nSmokers and people suffering from wounds and infections have increased vitamin C requirements.",
    "deficiency": "Capillary fragility\nSaggy and flabby skin due to lack of collagen\nAnaemia\nImpaired wound healing\nSwollen, bleeding gums\nLethargy\nFatigue\nIrritability\nPoor infection resistance (cold, flu, herpes, pneumonia, mononucleosis…)"
  },
  "vitamin_d": {
    "name": "vitamin D",
    "sources": "Oily fish such as sardines and pink salmon, margarine, vitamin D-fortified milk and some cereals...",
    "supplement": "",
    "toxicity": "The main symptoms result from hypercalcaemia. Anorexia, nausea, and vomiting can develop, often followed by polyuria, polydipsia, weakness, nervousness, pruritus, and eventually renal failure. As a result, proteinuria, urinary casts, azotemia, and metastatic calcifications (particularly in the kidneys) can occur.",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin D for adults is 5 mcg.\nThe Tolerable Upper Intake Level (UL) of vitamin D is 50 mcg.",
    "description": "Vitamin D is fat-soluble, meaning that it should be taken with a meal containing fat so your body can absorb it. It is best known for working with calcium in your body to help build and maintain strong bones and healthy teeth. It is frequently called the sunshine vitamin because it can be synthesised in the skin by exposure to direct sunlight.\nThere are two main forms of vitamin D – D2 and D3. D3 or cholecalciferol is naturally-occurring and is used for low-dose supplementation. Taking vitamin D along with calcium supplements can reduce the rate of bone loss, help prevent osteoporosis, and may reduce the risk of fractures. Vitamin D has the structure of a steroid hormone and behaves as such in the body. It is important for normal muscle function and a normal immune system.\nVitamin D deficiency is common and results from inadequate exposure to sunlight and inadequate dietary intake (usually occurring together) and from chronic kidney disease.",
    "deficiency": "Muscle aches, weakness\nBone pain\nOsteomalacia"
  },
  "vitamin_e": {
    "name": "vitamin E",
    "sources": "Grapeseed oil, cold-pressed vegetable oils, safflower oil, hazelnuts, dried apricots, avocado, peanut butter, olive oil, olives...\nVitamin E present in food degrades slowly over time and it is damaged by cooking at high temperatures.",
    "supplement": "Deficiency: 40-50 mg daily.",
    "toxicity": "Bleeding and impaired blood clotting\nMuscle weakness\nFatigue, nausea",
    "recommendedIntake": "The Daily Reference Intake (DRI) of vitamin E for adults is 12 mg.\nThe Tolerable Upper Intake Level (UL) for vitamin E is 1000 mg daily.",
    "description": "Vitamin E is a powerful antioxidant, found in many foods, fats, and oils. It is a fat-soluble vitamin, meaning it dissolves in fat and can be stored in your body until needed. Vitamin E provides protection against damage to the fats that line the outside of every cell of our body.\nVitamin E is a term describing eight different naturally occurring nutrients: four different tocopherols and four different tocotrienols. Of the vitamin E group, alpha-tocopherol is the most widely known.\nAlthough vitamin E deficiency is rare, marginal intake is relatively common. People with disorders that cause malabsorption of fats are prone to deficiency. People with diabetes tend to have low levels of vitamin E. Patients on anticoagulant therapy should be monitored when taking vitamin E supplements.",
    "deficiency": "Impaired balance and coordination \nInjury to the sensory nerves (peripheral neuropathy)\nMuscle weakness \nDamage to the retina\nImpairment of immune response"
  },
  "zinc": {
    "name": "zinc",
    "sources": "Oysters, crab, beef, turkey (dark meat), sesame seeds, pinto beans, ricotta, gouda cheese, miso...\nZinc is not destroyed by cooking or storage.",
    "supplement": "For treating the common cold: 9-24 mg zinc, several times a day.\nFor diarrhoea in malnourished or zinc-deficient children: 10-40 mg Zinc daily.\nFor treating acne: 30-135 mg zinc daily.\nA major consequence of long-term excess intake of zinc is copper deficiency. The UK Food Standards Agency Expert Group on Vitamins and Minerals (EVM) recommends that the upper safe level for long-term supplementation should be 25 mg of zinc per day.",
    "toxicity": "Abdominal pain\nDiarrhoea, nausea and vomiting",
    "recommendedIntake": "The Daily Reference Intake (DRI) of zinc for adults is 10 mg.\nThe Tolerable Upper Intake Level (UL) for zinc is 40 mg daily.",
    "description": "Zinc is an essential trace element for all forms of life. It has a pivotal role in growth and development, immune response, neurological function and reproduction.\nWith over 300 different enzymes depending on zinc, even a mild dietary deficiency may have far-reaching health implications.\nZinc plays a significant role in maintaining healthy vision and is present in high concentrations in the eye. It also affects the structure of proteins and the cell membrane and is a powerful antioxidant. Zinc helps with healing of wounds and is important for the proper functioning of taste and smell organs.\nGroups at risk of zinc deficiency are people with gastrointestinal diseases, vegetarians, pregnant and lactating women and alcoholics.",
    "deficiency": "Growth retardation\nLoss of appetite \nSlow wound healing\nPoor sense of smell and taste\nDelayed sexual maturation\nImpotence and infertility\nEye and skin lesions\nHair loss\nRough and dry skin\nDiarrhoea"
  }
}
