export const headers = [
  `<h4 style="color: red"><strong>ケトーシス（ketosis）レベル</strong></h4>を`,
  `<h4 style="color: red"><strong>全12段階で表示します。</strong></h4>`,
  '※ケトーシスとは、血液中の総ケトン体が200µmol/L以上の正常範囲内で増えた状態です。',
]

export const tableData = [
  [
    'アセトン（ppm）0.0 ~ 1.0',
    'ケトーシスが行われていません。',
    '体脂肪分解が行われておらず、2ppmになると',
    'ケトーシスに突入することが出来ます。',
  ],
  [
    'アセトン（ppm）1.1 ~ 1.9',
    'ケトーシスが行われていません。',
    '体脂肪分解が行われておらず、2ppmになると',
    'ケトーシスに突入すること出来ます。',
  ],
  [
    'アセトン（ppm）2.0 ~ 2.9',
    '初期レベルのケトーシス状態です。',
    '大変少量の体脂肪分解が始まっており、5ppm 以上になると適正',
    'レヘルに突入することが出来ます。',
  ],
  [
    'アセトン（ppm）3.0 ~ 3.9',
    '初期レベルのケトーシス状態です。大変少量の',
    '体脂肪分解が始まっており、5ppm 以上になると適正',
    'レヘルに突入することが出来ます。',
  ],
  [
    'アセトン（ppm）4.0~ 4.9',
    '初期レヘルのケトーシス状態です。大変少量の',
    '体脂肪分解が始まっており、5ppm 以上になる',
    'と適正レヘルに突入することが出来ます。',
  ],

  [
    'アセトン（ppm）5.0 ~ 5.9',
    '適正レベルのケトーシス状態です。',
    '適切な速度での体脂肪分解が始まっており、10ppm 以上になる',
    'と最適レベルに突入することが出来ます。',
  ],

  [
    'アセトン（ppm）6.0 ~ 6.9',
    '適正レヘルのケトーシス状態です。',
    '適切な速度での体脂肪分解が始まっており、10 ppm 以上になる',
    'と最適レヘルに突入することが出来ます。',
  ],

  [
    'アセトン（ppm）7.0 ~ 7.9',
    '適正レヘルのケトーシス状態です。',
    '適切な速度での体脂肪分解が始まっており、10 ppm 以上になる',
    'と最適レヘルに突入することが出来ます。',
  ],
  [
    'アセトン（ppm）8.0 ~ 8.9',
    '適正レベルのケトーシス状態です。適切な速度での',
    '体脂肪分解が始まっており、10 ppm 以上になる',
    'と最適レヘルに突入することが出来ます。',
  ],
  [
    'アセトン（ppm）9.0 ~ 9.9',
    '適正レベルのケトーシス状態です。適切な速度での',
    '体脂肪分解が始まっており、10 ppm 以上になる',
    'と最適レヘルに突入することが出来ます。',
  ],
  [
    'アセトン（ppm）10 ~ 40',
    '最適レヘルのケトーシス状態です。最大速度での',
    '体脂肪分解が行われていますが、出来るだけ40 ppm',
    'を超えないように注意が必要です。',
  ],
  [
    'アセトン（ppm）41 ~ 60',
    'ケトーシスが過度な状態です。',
    '体脂肪分解が効率的に行われてないので',
    '40 ppm 以下に調節が必要です。',
  ],
  [
    'アセトン（ppm）60 超過',
    'ケトーシスが大変過度な状態です。',
    '体に負担がかかる可能性があるので 40 ppm 以下に',
    '調節し専門家に相談することをおすすめします。',
  ],
]
